Tekla Open API Reference for Tekla Structures 2025
WpfBoltCatalogStandard.BoltSizes Property
 Returns bolt sizes in catalog based on selected grade
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomObservableCollection<Distance> BoltSizes { get; }
Public ReadOnly Property BoltSizes As CustomObservableCollection(Of Distance)
	Get
Property Value
Type: CustomObservableCollection<Distance>
See Also
Reference
WpfBoltCatalogStandard Class
Tekla.Structures.Dialog.UIControls Namespace